<?php include __DIR__ . "/../../views/shared/header.php"  ?>



<?php if (!empty($detailProduct)) { ?>
    <div class="infor-product mt-10 flex gap-12">
        <p id="notifi"></p>
        <div class="basis-1/2 bg-gray-100 rounded-xl flex justify-center items-center px-8 py-5 h-[580px]">
            <img class="w-full h-full object-cover rounded-xl" src="<?php echo $base_url ?>/uploads/images/<?php echo $detailProduct['product_image'] ?>" alt="">
        </div>
        <div class="basis-1/2 flex flex-col gap-4">
            <h2 class="text-3xl tracking-wider text-productName font-semibold"><?php echo $detailProduct['product_name'] ?></h2>
            <div class="flex items-center gap-2">
                <p class="text-2xl"><?php echo $detailProduct['price'] ?></p>
                <p class="text-gray-400 text-xl line-through"><?php echo $detailProduct['discount_price'] ?></p>
            </div>
            <p class="text-gray-500 text-lg"><?php echo $detailProduct['product_detail'] ?></p>
            <div class="quantity w-[140px] h-[55px] px-3 py-1 rounded-3xl bg-gray-100 flex items-center justify-center gap-3">
                <button id="decrease" type="button" class="text-[50px]">-</button>
                <input type="text" id="quantityProduct" class="quantityInput bg-gray-100 w-[40%] text-center outline-none text-2xl" value="1">
                <button id="increase" type="button" class="text-3xl">+</button>

            </div>

            <script>
                var quantity = 1;

                function updateInput() {
                    $('.quantityInput').val(quantity);
                    console.log(quantity);
                }

                $('#increase').on('click', function() {
                    quantity++;
                    updateInput();
                })

                $('#decrease').on('click', function() {
                    if (quantity > 1) {
                        quantity--;
                        updateInput();
                    }
                })

                $('.quantityInput').on('input', function() {
                    let val = parseInt($(this).val());
                    if (!isNaN(val) && val >= 1) {
                        quantity = val;
                    } else {
                        quantity = 1;
                    }
                    updateInput();
                });
            </script>

            <div class="flex gap-3 items-center">
                <div class="flex gap-1 items-center bg-mainColor px-6 py-2 text-white rounded-3xl">
                    <a class="text-lg" href="">Buy Now</a>
                    <svg width="30px" height="30px" viewBox="0 0 960 960" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
                        <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
                        <g id="SVGRepo_iconCarrier">
                            <path d="M475.448 702.412C406.938 702.412 338.418 703.092 269.923 702.076C205.224 702.528 118.821 694.142 117.31 611.319C112.909 527.954 96.3122 443.624 111.185 360.523C121.543 295.895 184.177 278.786 241.534 281.049C346.158 280.958 450.662 277.947 555.135 272.347C638.446 276.542 803.163 233.744 838.578 334.493C851.77 378.589 849.595 425.196 853.469 470.642C854.912 551.558 854.938 677.444 754.205 695.674C661.995 711.931 568.458 701.093 475.444 704.164C475.447 703.58 475.447 702.996 475.448 702.412ZM424.622 653.074C424.621 653.061 424.621 653.047 424.62 653.034C519.763 653.034 614.906 653.103 710.049 652.999C776.124 655.617 807.69 585.914 804.711 528.595C808.575 461.92 801.304 395.328 782.441 331.14C768.717 312.967 717.164 311.381 695.094 311.293C537.13 317.207 379.137 323.333 221.076 326.218C201.511 328.984 175.282 328.691 165.347 349.288C154.86 369.239 153.29 391.06 153.743 412.561C154.682 457.068 157.185 501.557 159.824 546.007C161.193 569.077 163.997 592.074 166.576 615.056C168.537 632.529 179.098 643.339 195.797 646.741C271.107 659.787 348.492 650.533 424.622 653.074Z" fill="#e0dcdc"></path>
                            <path d="M477.551 131.476C477.551 109.336 477.321 87.1927 477.629 65.0577C478.279 31.4447 525.841 32.6197 525.416 66.9797C525.588 109.755 525.624 152.555 524.038 195.309C524.342 228.391 478.256 230.876 477.717 197.893C477.463 175.757 477.651 153.615 477.651 131.476C477.617 131.476 477.584 131.476 477.551 131.476Z" fill="#e0dcdc"></path>
                            <path d="M506.142 840.64C505.863 859.791 506.756 879.035 505.714 898.146C502.457 927.761 460.741 926.06 459.773 896.353C458.062 860.542 457.865 824.677 457.012 788.839C456.646 772.785 464.647 761.025 477.398 759.15C519.249 756.101 503.067 814.414 505.94 840.64C506.007 840.64 506.075 840.64 506.142 840.64Z" fill="#e0dcdc"></path>
                            <path d="M363.714 255.667C351.164 252.159 341.517 244.565 332.533 235.415C318.342 222.562 304.325 209.515 290.014 196.798C261.892 176.103 291.903 134.481 320.23 158.968C341.25 179.104 364.659 197.877 382.331 221.08C391.369 236.024 381.279 254.241 363.714 255.667Z" fill="#e0dcdc"></path>
                            <path d="M586.134 731.82C612.423 741.785 631.461 764.062 653.596 780.724C677.253 799.103 651.146 832.567 627.418 814.943C608.954 801.911 590.834 788.362 572.97 774.513C554.591 760.479 563.727 733.745 586.134 731.82Z" fill="#e0dcdc"></path>
                            <path d="M604.674 246.415C581.352 244.941 575.988 216.978 593.687 204.619C609.585 191.484 625.805 178.734 641.996 165.955C649.021 160.41 656.941 157.972 665.729 161.025C682.581 166.88 685.922 187.821 671.5 200.173C649.968 216.364 630.145 236.656 604.674 246.415Z" fill="#e0dcdc"></path>
                            <path d="M351.843 738.77C411.404 753.772 344.094 807.091 315.128 815.999C305.271 820.098 294.752 814.353 289.6 805.468C284.525 796.714 284.947 784.815 293.07 777.95C308.038 765.301 323.986 753.782 339.88 742.282C343.054 739.986 347.815 739.884 351.843 738.77Z" fill="#e0dcdc"></path>
                            <path d="M424.623 653.077C348.489 650.54 271.113 659.786 195.797 646.749C179.099 643.343 168.538 632.533 166.577 615.06C163.998 592.078 161.195 569.081 159.825 546.011C157.186 501.561 154.683 457.072 153.744 412.565C153.29 391.063 154.86 369.242 165.348 349.293C175.217 328.67 201.578 329.015 221.076 326.222C379.138 323.337 537.132 317.21 695.094 311.297C717.752 311.397 768.342 312.951 782.446 331.141C801.292 395.335 808.587 461.921 804.711 528.6C807.657 585.896 776.163 655.649 710.048 653C614.907 653.105 519.764 653.037 424.622 653.037C424.622 653.051 424.622 653.064 424.623 653.077ZM368.82 469.328C439.009 377.24 246.578 302.471 241.47 416.55C244.678 463.207 244.995 509.977 245.965 556.716C249.255 593.656 293.969 585.89 320.42 587.38C378.188 587.352 414.98 517.669 368.82 469.328ZM395.989 472.889C396.939 488.33 397.129 500.549 398.547 512.624C399.841 571.073 474.145 626.171 519.168 572.358C559.797 523.729 550.58 456.286 548.107 397.482C547.844 367.977 507.368 367.875 508.864 398.04C510.387 446.775 522.001 503.822 491.077 545.863C481.027 556.913 471.495 557.814 459.549 548.856C423.144 522.765 441.346 431.359 439.96 389.689C442.001 365.239 410.587 359.752 405.285 384.257C398.04 412.719 398.924 446.295 395.989 472.889ZM635.924 445.95C619.304 419.91 605.823 397.084 589.652 372.233C572.704 347.414 543.327 370.115 558.444 394.233C574.813 420.677 590.549 447.552 607.988 473.272C613.386 481.233 615.111 488.329 614.745 497.263C613.653 523.868 612.813 550.489 612.337 577.113C612.138 588.257 619.96 596.29 629.883 596.53C640.143 596.778 647.729 589.619 648.209 578.107C649.392 549.76 650.385 521.401 650.926 493.036C651.057 486.19 651.896 480.881 657.883 476.405C680.354 452.527 693.688 420.701 712.138 393.599C723.858 375.599 701.459 354.103 685.052 369.495C666.777 394.404 654.855 420.572 635.924 445.95Z" fill="white"></path>
                            <path d="M368.82 469.325C414.982 517.664 378.186 587.351 320.42 587.378C293.995 585.918 249.225 593.644 245.965 556.713C244.995 509.975 244.678 463.204 241.473 416.547C246.569 302.49 439.017 377.212 368.82 469.325ZM279.024 494.857C282.425 549.219 262.479 545.358 322.199 546.758C351.242 547.668 362.807 500.496 331.33 495.226C314.736 493.607 297.86 494.857 279.024 494.857ZM280.399 455.035C296.481 453.096 311.678 451.561 326.756 449.243C373.611 433.678 318.565 386.534 289.565 401.13C285.939 402.511 281.014 406.654 280.812 409.79C279.877 424.283 280.399 438.869 280.399 455.035Z" fill="#e0dcdc"></path>
                            <path d="M395.988 472.887C398.921 446.293 398.04 412.717 405.282 384.254C410.612 359.793 441.976 365.196 439.961 389.688C441.316 431.199 423.198 522.953 459.545 548.855C471.494 557.812 481.026 556.911 491.073 545.861C522.003 503.807 510.379 446.789 508.865 398.039C507.331 367.934 547.871 367.928 548.106 397.482C550.585 456.266 559.795 523.748 519.165 572.36C474.139 626.137 399.841 571.098 398.55 512.62C397.128 500.547 396.938 488.327 395.988 472.887Z" fill="#e0dcdc"></path>
                            <path d="M635.922 445.95C654.849 420.58 666.782 394.393 685.047 369.493C701.387 354.159 723.908 375.532 712.13 393.598C693.687 420.7 680.348 452.529 657.882 476.407C651.892 480.881 651.053 486.19 650.923 493.036C650.382 521.401 649.389 549.76 648.206 578.107C647.726 589.618 640.14 596.778 629.88 596.53C619.958 596.29 612.135 588.258 612.334 577.113C612.81 550.49 613.651 523.869 614.742 497.263C615.109 488.329 613.383 481.232 607.985 473.272C590.546 447.551 574.81 420.676 558.44 394.232C543.368 370.17 572.644 347.362 589.65 372.234C605.824 397.089 619.299 419.907 635.922 445.95Z" fill="#e0dcdc"></path>
                            <path d="M279.023 494.859C297.859 494.859 314.735 493.609 331.331 495.229C362.794 500.503 351.254 547.669 322.198 546.76C262.457 545.379 282.43 549.156 279.023 494.859Z" fill="white"></path>
                            <path d="M280.399 455.035C280.399 438.87 279.877 424.283 280.812 409.79C281.014 406.655 285.939 402.511 289.565 401.128C318.575 386.54 373.609 433.677 326.756 449.245C311.678 451.561 296.48 453.095 280.399 455.035Z" fill="white"></path>
                        </g>
                    </svg>
                </div>

                <form method="POST" class="form-submit">
                    <input type="hidden" class="product_id" value="<?php echo $detailProduct['product_id'] ?>">
                    <div class="flex items-center gap-1 bg-red-400 px-4 py-1 rounded-3xl">
                        <button type="submit" class="add-cart text-white">Thêm giỏ hàng</button>
                        <svg width="32px" height="32px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
                            <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
                            <g id="SVGRepo_iconCarrier">
                                <path d="M21 5L19 12H7.37671M20 16H8L6 3H3M16 5.5H13.5M13.5 5.5H11M13.5 5.5V8M13.5 5.5V3M9 20C9 20.5523 8.55228 21 8 21C7.44772 21 7 20.5523 7 20C7 19.4477 7.44772 19 8 19C8.55228 19 9 19.4477 9 20ZM20 20C20 20.5523 19.5523 21 19 21C18.4477 21 18 20.5523 18 20C18 19.4477 18.4477 19 19 19C19.5523 19 20 19.4477 20 20Z" stroke="#f5f5f5" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                            </g>
                        </svg>
                    </div>
                </form>


                <a class="bg-mainProduct py-3 px-3 rounded-full" href="">
                    <svg width="40px" height="40px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
                        <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
                        <g id="SVGRepo_iconCarrier">
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M12 6.00019C10.2006 3.90317 7.19377 3.2551 4.93923 5.17534C2.68468 7.09558 2.36727 10.3061 4.13778 12.5772C5.60984 14.4654 10.0648 18.4479 11.5249 19.7369C11.6882 19.8811 11.7699 19.9532 11.8652 19.9815C11.9483 20.0062 12.0393 20.0062 12.1225 19.9815C12.2178 19.9532 12.2994 19.8811 12.4628 19.7369C13.9229 18.4479 18.3778 14.4654 19.8499 12.5772C21.6204 10.3061 21.3417 7.07538 19.0484 5.17534C16.7551 3.2753 13.7994 3.90317 12 6.00019Z" stroke="#696969" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                        </g>
                    </svg>
                </a>
            </div>
            <div class="flex gap-1">
                <p class="text-gray-500">Already Sold</p>
                <span>700</span>
            </div>
            <h2 class="border border-gray-300"></h2>
            <div class="flex flex-col gap-3 mt-2 text-xl">
                <div class="flex gap-1">
                    <p class="text-gray-500">Author:</p>
                    <span class="text-productName"><?php echo $detailProduct['product_author'] ?></span>
                </div>
                <div class="flex gap-1">
                    <p class="text-gray-500">Category:</p>
                    <span class="text-productName">Philosophy</span>
                </div>
                <div class="flex gap-1">
                    <p class="text-gray-500">Publisher:</p>
                    <span class="text-productName"><?php echo $detailProduct['publisher'] ?></span>
                </div>
                <div class="flex gap-1">
                    <p class="text-gray-500">Language:</p>
                    <span class="text-productName"><?php echo $detailProduct['product_language'] ?></span>
                </div>
            </div>
        </div>

        <!-- Modal khi thêm giỏ hàng thành công -->
        <div id="successModal" class="fixed inset-0 bg-black bg-opacity-50 items-center flex justify-center z-50 hidden">
            <div class="bg-white rounded-2xl shadow-2xl w-1/2 px-8 py-7 transform transition-all scale-100">
                <!-- Icon thành công -->
                <div class="flex justify-center mb-4">
                    <svg class="w-16 h-16 text-green-500" fill="none" stroke="currentColor" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg">
                        <path stroke-linecap="round" stroke-linejoin="round" stroke-width="2" d="M9 12l2 2 4-4m6 2a9 9 0 11-18 0 9 9 0 0118 0z"></path>
                    </svg>
                </div>
                <!-- Nội dung -->
                <h2 class="text-2xl font-bold text-gray-800 text-center mb-2">Thêm giỏ hàng thành công!</h2>
                <p class="text-gray-600 text-center mb-6">Sản phẩm đã được thêm vào giỏ hàng của bạn.</p>
                <!-- Nút -->
                <div class="flex justify-center items-center gap-4">
                    <button onclick="closeModal()" class="bg-gray-200 text-gray-700 px-4 py-2 rounded-lg hover:bg-gray-300 transition duration-200">
                        Tiếp tục mua sắm
                    </button>
                    <a href="index.php?controller=cart&action=detail" class="bg-green-500 text-white px-4 py-2 rounded-lg hover:bg-green-600 transition duration-200">
                        Xem giỏ hàng
                    </a>
                </div>
            </div>
        </div>

    </div>
<?php } ?>

<div class="review-product mt-24 flex gap-14">
    <div class="basis-2/3">
        <h2 class="text-[34px] text-productName font-semibold mb-7">3 Comments</h2>
        <div class="flex flex-col gap-16">
            <div class="flex gap-5 items-center">
                <div class="w-[95px] h-[75px]">
                    <img class="w-full h-full object-cover rounded-xl" src="<?php echo $base_url . 'images/nguongmo.jpg' ?>" alt="">
                </div>
                <div class="flex flex-col gap-1">
                    <p class="text-productAuthor font-semibold">23, July 2023</p>
                    <p class="text-productName font-semibold text-lg">Isabella Garcia</p>
                    <span class="star flex items-center">
                        <svg width="26px" height="26px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" class="">
                            <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
                            <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
                            <g id="SVGRepo_iconCarrier">
                                <path fill="#ffc107" d="M11.2691 4.41115C11.5006 3.89177 11.6164 3.63208 11.7776 3.55211C11.9176 3.48263 12.082 3.48263 12.222 3.55211C12.3832 3.63208 12.499 3.89177 12.7305 4.41115L14.5745 8.54808C14.643 8.70162 14.6772 8.77839 14.7302 8.83718C14.777 8.8892 14.8343 8.93081 14.8982 8.95929C14.9705 8.99149 15.0541 9.00031 15.2213 9.01795L19.7256 9.49336C20.2911 9.55304 20.5738 9.58288 20.6997 9.71147C20.809 9.82316 20.8598 9.97956 20.837 10.1342C20.8108 10.3122 20.5996 10.5025 20.1772 10.8832L16.8125 13.9154C16.6877 14.0279 16.6252 14.0842 16.5857 14.1527C16.5507 14.2134 16.5288 14.2807 16.5215 14.3503C16.5132 14.429 16.5306 14.5112 16.5655 14.6757L17.5053 19.1064C17.6233 19.6627 17.6823 19.9408 17.5989 20.1002C17.5264 20.2388 17.3934 20.3354 17.2393 20.3615C17.0619 20.3915 16.8156 20.2495 16.323 19.9654L12.3995 17.7024C12.2539 17.6184 12.1811 17.5765 12.1037 17.56C12.0352 17.5455 11.9644 17.5455 11.8959 17.56C11.8185 17.5765 11.7457 17.6184 11.6001 17.7024L7.67662 19.9654C7.18404 20.2495 6.93775 20.3915 6.76034 20.3615C6.60623 20.3354 6.47319 20.2388 6.40075 20.1002C6.31736 19.9408 6.37635 19.6627 6.49434 19.1064L7.4341 14.6757C7.46898 14.5112 7.48642 14.429 7.47814 14.3503C7.47081 14.2807 7.44894 14.2134 7.41394 14.1527C7.37439 14.0842 7.31195 14.0279 7.18708 13.9154L3.82246 10.8832C3.40005 10.5025 3.18884 10.3122 3.16258 10.1342C3.13978 9.97956 3.19059 9.82316 3.29993 9.71147C3.42581 9.58288 3.70856 9.55304 4.27406 9.49336L8.77835 9.01795C8.94553 9.00031 9.02911 8.99149 9.10139 8.95929C9.16534 8.93081 9.2226 8.8892 9.26946 8.83718C9.32241 8.77839 9.35663 8.70162 9.42508 8.54808L11.2691 4.41115Z" stroke="" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                            </g>
                        </svg>
                    </span>
                    <p class="text-gray-500 text-justify text-lg">Lorem, ipsum dolor sit amet consectetur adipisicing elit. Nihil quis ab laudantium aperiam dolorem reprehenderit animi, pariatur nemo distinctio id?</p>
                </div>
            </div>
            <div class="flex gap-5 items-center">
                <div class="w-[95px] h-[75px]">
                    <img class="w-full h-full object-cover rounded-xl" src="<?php echo $base_url . 'images/nguongmo.jpg' ?>" alt="">
                </div>
                <div class="flex flex-col gap-1">
                    <p class="text-productAuthor font-semibold">23, July 2023</p>
                    <p class="text-productName font-semibold text-lg">Isabella Garcia</p>
                    <span class="star flex items-center">
                        <svg width="26px" height="26px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" class="">
                            <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
                            <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
                            <g id="SVGRepo_iconCarrier">
                                <path fill="#ffc107" d="M11.2691 4.41115C11.5006 3.89177 11.6164 3.63208 11.7776 3.55211C11.9176 3.48263 12.082 3.48263 12.222 3.55211C12.3832 3.63208 12.499 3.89177 12.7305 4.41115L14.5745 8.54808C14.643 8.70162 14.6772 8.77839 14.7302 8.83718C14.777 8.8892 14.8343 8.93081 14.8982 8.95929C14.9705 8.99149 15.0541 9.00031 15.2213 9.01795L19.7256 9.49336C20.2911 9.55304 20.5738 9.58288 20.6997 9.71147C20.809 9.82316 20.8598 9.97956 20.837 10.1342C20.8108 10.3122 20.5996 10.5025 20.1772 10.8832L16.8125 13.9154C16.6877 14.0279 16.6252 14.0842 16.5857 14.1527C16.5507 14.2134 16.5288 14.2807 16.5215 14.3503C16.5132 14.429 16.5306 14.5112 16.5655 14.6757L17.5053 19.1064C17.6233 19.6627 17.6823 19.9408 17.5989 20.1002C17.5264 20.2388 17.3934 20.3354 17.2393 20.3615C17.0619 20.3915 16.8156 20.2495 16.323 19.9654L12.3995 17.7024C12.2539 17.6184 12.1811 17.5765 12.1037 17.56C12.0352 17.5455 11.9644 17.5455 11.8959 17.56C11.8185 17.5765 11.7457 17.6184 11.6001 17.7024L7.67662 19.9654C7.18404 20.2495 6.93775 20.3915 6.76034 20.3615C6.60623 20.3354 6.47319 20.2388 6.40075 20.1002C6.31736 19.9408 6.37635 19.6627 6.49434 19.1064L7.4341 14.6757C7.46898 14.5112 7.48642 14.429 7.47814 14.3503C7.47081 14.2807 7.44894 14.2134 7.41394 14.1527C7.37439 14.0842 7.31195 14.0279 7.18708 13.9154L3.82246 10.8832C3.40005 10.5025 3.18884 10.3122 3.16258 10.1342C3.13978 9.97956 3.19059 9.82316 3.29993 9.71147C3.42581 9.58288 3.70856 9.55304 4.27406 9.49336L8.77835 9.01795C8.94553 9.00031 9.02911 8.99149 9.10139 8.95929C9.16534 8.93081 9.2226 8.8892 9.26946 8.83718C9.32241 8.77839 9.35663 8.70162 9.42508 8.54808L11.2691 4.41115Z" stroke="" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                            </g>
                        </svg>
                    </span>
                    <p class="text-gray-500 text-justify text-lg">Lorem, ipsum dolor sit amet consectetur adipisicing elit. Nihil quis ab laudantium aperiam dolorem reprehenderit animi, pariatur nemo distinctio id?</p>
                </div>
            </div>
        </div>

    </div>
    <div class="basis-1/3">
        <h2 class="text-[34px] text-productName font-semibold mb-3">Leave a Review</h2>
        <div class="flex flex-col gap-3 justify-center">
            <div class="flex flex-col">
                <h2 class="text-xl m-0 p-0">Rating</h2>
                <span class="star flex items-center">
                    <svg width="26px" height="26px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" class="">
                        <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
                        <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
                        <g id="SVGRepo_iconCarrier">
                            <path fill="#ffc107" d="M11.2691 4.41115C11.5006 3.89177 11.6164 3.63208 11.7776 3.55211C11.9176 3.48263 12.082 3.48263 12.222 3.55211C12.3832 3.63208 12.499 3.89177 12.7305 4.41115L14.5745 8.54808C14.643 8.70162 14.6772 8.77839 14.7302 8.83718C14.777 8.8892 14.8343 8.93081 14.8982 8.95929C14.9705 8.99149 15.0541 9.00031 15.2213 9.01795L19.7256 9.49336C20.2911 9.55304 20.5738 9.58288 20.6997 9.71147C20.809 9.82316 20.8598 9.97956 20.837 10.1342C20.8108 10.3122 20.5996 10.5025 20.1772 10.8832L16.8125 13.9154C16.6877 14.0279 16.6252 14.0842 16.5857 14.1527C16.5507 14.2134 16.5288 14.2807 16.5215 14.3503C16.5132 14.429 16.5306 14.5112 16.5655 14.6757L17.5053 19.1064C17.6233 19.6627 17.6823 19.9408 17.5989 20.1002C17.5264 20.2388 17.3934 20.3354 17.2393 20.3615C17.0619 20.3915 16.8156 20.2495 16.323 19.9654L12.3995 17.7024C12.2539 17.6184 12.1811 17.5765 12.1037 17.56C12.0352 17.5455 11.9644 17.5455 11.8959 17.56C11.8185 17.5765 11.7457 17.6184 11.6001 17.7024L7.67662 19.9654C7.18404 20.2495 6.93775 20.3915 6.76034 20.3615C6.60623 20.3354 6.47319 20.2388 6.40075 20.1002C6.31736 19.9408 6.37635 19.6627 6.49434 19.1064L7.4341 14.6757C7.46898 14.5112 7.48642 14.429 7.47814 14.3503C7.47081 14.2807 7.44894 14.2134 7.41394 14.1527C7.37439 14.0842 7.31195 14.0279 7.18708 13.9154L3.82246 10.8832C3.40005 10.5025 3.18884 10.3122 3.16258 10.1342C3.13978 9.97956 3.19059 9.82316 3.29993 9.71147C3.42581 9.58288 3.70856 9.55304 4.27406 9.49336L8.77835 9.01795C8.94553 9.00031 9.02911 8.99149 9.10139 8.95929C9.16534 8.93081 9.2226 8.8892 9.26946 8.83718C9.32241 8.77839 9.35663 8.70162 9.42508 8.54808L11.2691 4.41115Z" stroke="" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                        </g>
                    </svg>
                </span>
            </div>
            <textarea class="border border-gray-300 outline-none rounded-xl px-2 py-2" rows="8" name="" id=""></textarea>
            <button type="submit" class="text-white text-lg px-4 py-2 bg-mainColor w-[42%] rounded-3xl">Submit Review</button>
        </div>
    </div>
</div>

<div class="related-product mt-24">
    <h2 class="text-[34px] text-productName font-semibold mb-6">Related Product</h2>
    <?php if (!empty($relatedProduct)) { ?>
        <div class="flex items-center gap-9">
            <?php foreach ($relatedProduct as $product) { ?>
                <div class="arrival-book bg-mainProduct shadow-mainShadow rounded-3xl px-6 py-7 basis-1/4">
                    <div class="w-full h-[340px]">
                        <a href="">
                            <img class="w-full h-full object-cover rounded-xl" src="<?php echo $base_url . 'uploads/images/' . $product['product_image'] ?>" alt="">
                        </a>
                    </div>

                    <div class="flex flex-col mt-3">
                        <h3 class="text-2xl text-productName font-semibold tracking-wider"><?php echo $product['product_name'] ?></h3>
                        <span class="star flex items-center my-1">
                            <svg width="28px" height="28px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
                                <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
                                <g id="SVGRepo_iconCarrier">
                                    <path fill="#ffc107" d="M11.2691 4.41115C11.5006 3.89177 11.6164 3.63208 11.7776 3.55211C11.9176 3.48263 12.082 3.48263 12.222 3.55211C12.3832 3.63208 12.499 3.89177 12.7305 4.41115L14.5745 8.54808C14.643 8.70162 14.6772 8.77839 14.7302 8.83718C14.777 8.8892 14.8343 8.93081 14.8982 8.95929C14.9705 8.99149 15.0541 9.00031 15.2213 9.01795L19.7256 9.49336C20.2911 9.55304 20.5738 9.58288 20.6997 9.71147C20.809 9.82316 20.8598 9.97956 20.837 10.1342C20.8108 10.3122 20.5996 10.5025 20.1772 10.8832L16.8125 13.9154C16.6877 14.0279 16.6252 14.0842 16.5857 14.1527C16.5507 14.2134 16.5288 14.2807 16.5215 14.3503C16.5132 14.429 16.5306 14.5112 16.5655 14.6757L17.5053 19.1064C17.6233 19.6627 17.6823 19.9408 17.5989 20.1002C17.5264 20.2388 17.3934 20.3354 17.2393 20.3615C17.0619 20.3915 16.8156 20.2495 16.323 19.9654L12.3995 17.7024C12.2539 17.6184 12.1811 17.5765 12.1037 17.56C12.0352 17.5455 11.9644 17.5455 11.8959 17.56C11.8185 17.5765 11.7457 17.6184 11.6001 17.7024L7.67662 19.9654C7.18404 20.2495 6.93775 20.3915 6.76034 20.3615C6.60623 20.3354 6.47319 20.2388 6.40075 20.1002C6.31736 19.9408 6.37635 19.6627 6.49434 19.1064L7.4341 14.6757C7.46898 14.5112 7.48642 14.429 7.47814 14.3503C7.47081 14.2807 7.44894 14.2134 7.41394 14.1527C7.37439 14.0842 7.31195 14.0279 7.18708 13.9154L3.82246 10.8832C3.40005 10.5025 3.18884 10.3122 3.16258 10.1342C3.13978 9.97956 3.19059 9.82316 3.29993 9.71147C3.42581 9.58288 3.70856 9.55304 4.27406 9.49336L8.77835 9.01795C8.94553 9.00031 9.02911 8.99149 9.10139 8.95929C9.16534 8.93081 9.2226 8.8892 9.26946 8.83718C9.32241 8.77839 9.35663 8.70162 9.42508 8.54808L11.2691 4.41115Z" stroke="" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                                </g>
                            </svg>
                            <svg width="28px" height="28px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
                                <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
                                <g id="SVGRepo_iconCarrier">
                                    <path fill="#ffc107" d="M11.2691 4.41115C11.5006 3.89177 11.6164 3.63208 11.7776 3.55211C11.9176 3.48263 12.082 3.48263 12.222 3.55211C12.3832 3.63208 12.499 3.89177 12.7305 4.41115L14.5745 8.54808C14.643 8.70162 14.6772 8.77839 14.7302 8.83718C14.777 8.8892 14.8343 8.93081 14.8982 8.95929C14.9705 8.99149 15.0541 9.00031 15.2213 9.01795L19.7256 9.49336C20.2911 9.55304 20.5738 9.58288 20.6997 9.71147C20.809 9.82316 20.8598 9.97956 20.837 10.1342C20.8108 10.3122 20.5996 10.5025 20.1772 10.8832L16.8125 13.9154C16.6877 14.0279 16.6252 14.0842 16.5857 14.1527C16.5507 14.2134 16.5288 14.2807 16.5215 14.3503C16.5132 14.429 16.5306 14.5112 16.5655 14.6757L17.5053 19.1064C17.6233 19.6627 17.6823 19.9408 17.5989 20.1002C17.5264 20.2388 17.3934 20.3354 17.2393 20.3615C17.0619 20.3915 16.8156 20.2495 16.323 19.9654L12.3995 17.7024C12.2539 17.6184 12.1811 17.5765 12.1037 17.56C12.0352 17.5455 11.9644 17.5455 11.8959 17.56C11.8185 17.5765 11.7457 17.6184 11.6001 17.7024L7.67662 19.9654C7.18404 20.2495 6.93775 20.3915 6.76034 20.3615C6.60623 20.3354 6.47319 20.2388 6.40075 20.1002C6.31736 19.9408 6.37635 19.6627 6.49434 19.1064L7.4341 14.6757C7.46898 14.5112 7.48642 14.429 7.47814 14.3503C7.47081 14.2807 7.44894 14.2134 7.41394 14.1527C7.37439 14.0842 7.31195 14.0279 7.18708 13.9154L3.82246 10.8832C3.40005 10.5025 3.18884 10.3122 3.16258 10.1342C3.13978 9.97956 3.19059 9.82316 3.29993 9.71147C3.42581 9.58288 3.70856 9.55304 4.27406 9.49336L8.77835 9.01795C8.94553 9.00031 9.02911 8.99149 9.10139 8.95929C9.16534 8.93081 9.2226 8.8892 9.26946 8.83718C9.32241 8.77839 9.35663 8.70162 9.42508 8.54808L11.2691 4.41115Z" stroke="" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                                </g>
                            </svg>
                            <svg width="28px" height="28px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
                                <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
                                <g id="SVGRepo_iconCarrier">
                                    <path fill="#ffc107" d="M11.2691 4.41115C11.5006 3.89177 11.6164 3.63208 11.7776 3.55211C11.9176 3.48263 12.082 3.48263 12.222 3.55211C12.3832 3.63208 12.499 3.89177 12.7305 4.41115L14.5745 8.54808C14.643 8.70162 14.6772 8.77839 14.7302 8.83718C14.777 8.8892 14.8343 8.93081 14.8982 8.95929C14.9705 8.99149 15.0541 9.00031 15.2213 9.01795L19.7256 9.49336C20.2911 9.55304 20.5738 9.58288 20.6997 9.71147C20.809 9.82316 20.8598 9.97956 20.837 10.1342C20.8108 10.3122 20.5996 10.5025 20.1772 10.8832L16.8125 13.9154C16.6877 14.0279 16.6252 14.0842 16.5857 14.1527C16.5507 14.2134 16.5288 14.2807 16.5215 14.3503C16.5132 14.429 16.5306 14.5112 16.5655 14.6757L17.5053 19.1064C17.6233 19.6627 17.6823 19.9408 17.5989 20.1002C17.5264 20.2388 17.3934 20.3354 17.2393 20.3615C17.0619 20.3915 16.8156 20.2495 16.323 19.9654L12.3995 17.7024C12.2539 17.6184 12.1811 17.5765 12.1037 17.56C12.0352 17.5455 11.9644 17.5455 11.8959 17.56C11.8185 17.5765 11.7457 17.6184 11.6001 17.7024L7.67662 19.9654C7.18404 20.2495 6.93775 20.3915 6.76034 20.3615C6.60623 20.3354 6.47319 20.2388 6.40075 20.1002C6.31736 19.9408 6.37635 19.6627 6.49434 19.1064L7.4341 14.6757C7.46898 14.5112 7.48642 14.429 7.47814 14.3503C7.47081 14.2807 7.44894 14.2134 7.41394 14.1527C7.37439 14.0842 7.31195 14.0279 7.18708 13.9154L3.82246 10.8832C3.40005 10.5025 3.18884 10.3122 3.16258 10.1342C3.13978 9.97956 3.19059 9.82316 3.29993 9.71147C3.42581 9.58288 3.70856 9.55304 4.27406 9.49336L8.77835 9.01795C8.94553 9.00031 9.02911 8.99149 9.10139 8.95929C9.16534 8.93081 9.2226 8.8892 9.26946 8.83718C9.32241 8.77839 9.35663 8.70162 9.42508 8.54808L11.2691 4.41115Z" stroke="" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                                </g>
                            </svg>
                        </span>
                        <p class="mt-2 mb-1 text-lg text-productAuthor"><?php echo $product['product_author'] ?></p>
                        <div class="flex items-center justify-between">
                            <div class="flex items-center gap-2">
                                <p class="text-xl"><?php echo $product['price'] ?></p>
                                <span class="text-gray-400 line-through">
                                    <?php echo $product['discount_price'] ?></span>
                            </div>
                        </div>
                    </div>
                </div>
            <?php } ?>
        </div>
    <?php } ?>
</div>

<?php include __DIR__ . "/../../views/shared/footer.php"  ?>